app/controllers/home_controller.rb

	def index
		sleep 1 if request.xhr?
		@photo_collections = PhotoCollection.paginate(:per_page => 7, :page => params[:page])
---
SELECT COUNT(*) FROM `photo_collections`
SELECT `photo_collections`.* FROM `photo_collections` LIMIT 1 OFFSET 0