app/controllers/photo_collections_controller.rb

SELECT COUNT(*) FROM `photo_collections`
SELECT `photo_collections`.* FROM `photo_collections` LIMIT 1 OFFSET 0
---
	def index
		sleep 1 if request.xhr?
		@photo_collections = PhotoCollection.paginate(:per_page => 7, :page => params[:page])

SELECT COUNT(*) FROM `photo_collections` WHERE `photo_collections`.`user_id` = ?  [["user_id", 2]]
SELECT `photo_collections`.* FROM `photo_collections` WHERE `photo_collections`.`user_id` = ? LIMIT 7 OFFSET 0  [["user_id", 2]]
---
	def my_collections
		sleep 1 if request.xhr?
		@photo_collections = current_user.photo_collections.paginate(:per_page => 7, :page => params[:page])

SELECT `photo_collections`.* FROM `photo_collections`
---
	def galleries
		sleep 1
		@photo_collections = PhotoCollection.all

INSERT INTO `photo_collections` (`created_at`, `description`, `name`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 14 Oct 2013 16:04:22 UTC +00:00], ["description", "zsfs"], ["name", "Office"], ["updated_at", Mon, 14 Oct 2013 16:04:22 UTC +00:00], ["user_id", 1]]
---
	def create
	 	@photo_collection = PhotoCollection.new(params[:photo_collection])
	 	@photo_collection.user_id = current_user.id
	 	if @photo_collection.save

SELECT `photo_collections`.* FROM `photo_collections` WHERE `photo_collections`.`id` = ? LIMIT 1  [["id", "6"]]
---
	def edit
		@photo_collection = PhotoCollection.find(params[:id])

SELECT `photo_collections`.* FROM `photo_collections` WHERE `photo_collections`.`id` = ? LIMIT 1  [["id", "6"]]
---
	def update
		@photo_collection = PhotoCollection.find(params[:id])

SELECT `photo_collections`.* FROM `photo_collections` WHERE `photo_collections`.`token` = '1' LIMIT 1
---
	def show
		@photo_collection = PhotoCollection.find_by_token(params[:token])

SELECT `photo_collections`.* FROM `photo_collections` WHERE `photo_collections`.`id` = ? LIMIT 1  [["id", "14"]]
DELETE FROM `photo_collections` WHERE `photo_collections`.`id` = ?  [["id", 14]]
---
	def destroy
		@photo_collection = PhotoCollection.find(params[:id])
		@photo_collection.destroy